#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_object.frontend["index.html"]: Refreshing state... [id=index.html]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_cloudfront_distribution.s3_distribution has changed
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 3600 -> 0
          ~ max_ttl                  = 86400 -> 0
            # (11 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - logging_config {
          - bucket          = "rayprogramming-logs.s3.amazonaws.com" -> null
          - include_cookies = true -> null
          - prefix          = "video.rayprogramming.com/cdn" -> null
        }



        # (3 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] has been deleted
  - resource "aws_s3_bucket_object" "frontend" {
      - acl                = "private" -> null
      - bucket             = "video.rayprogramming.com" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/html" -> null
      - etag               = "b00256700d0e30f81da136972e5b907f" -> null
      - force_destroy      = false -> null
      - id                 = "index.html" -> null
      - key                = "index.html" -> null
      - kms_key_id         = "arn:aws:kms:us-east-2:529080338478:key/f1c85d82-243d-45fe-bfe6-5a2fdd6bf44e" -> null
      - metadata           = {} -> null
      - source             = "frontend/../../frontend/index.html" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - version_id         = ".3OpFi9TUy_vz2yOC.8AxJyw474WraVL" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 3600
          ~ max_ttl                  = 0 -> 86400
            # (11 unchanged attributes hidden)
        }

      + logging_config {
          + bucket          = "rayprogramming-logs.s3.amazonaws.com"
          + include_cookies = true
          + prefix          = "video.rayprogramming.com/cdn"
        }



        # (3 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] will be created
  + resource "aws_s3_bucket_object" "frontend" {
      + acl                    = "private"
      + bucket                 = "video.rayprogramming.com"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "b00256700d0e30f81da136972e5b907f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*